#include <iostream>
#include <cmath>
using namespace std;


int main()
{
    int num = 0, t = 0, d = 1, k = 0, num_alf;
    cout << "Введите десятичное число: ";
    cin >> num;
    
    while(num){
        t += (num % 2) * d; //сумма числа
        num = num / 2; 
        d = d * 10; // разряды
    }
    cout << "Число в двоичной системе исчисления: " << t << endl;
    
    num = 0, t = 0, d = 1;
    cout << "Введите число в восьмиричной системе исчисления: ";
    cin >> num;
    
    //перевод из 8-ой в 10-ую сс
    while(num){
        t += (num % 10) * pow(8, k); 
        num = num / 10;
        k++;
    }
    num = t;
    t = 0;
    //перевод из 10-ой в 16-ую
    while(num){
        t += (num % 16) * d;
        num = num / 16;
        d = d * 10;
    }
    num_alf = t / 10;
    if(num_alf == 10){
        cout << "Число в шетнадцатиричной системе исчисления: A" << t%10; 
    }
    else if(num_alf == 11){
        cout << "Число в шетнадцатиричной системе исчисления: B" << t%10;
    }
    else if(num_alf == 12){
        cout << "Число в шетнадцатиричной системе исчисления: C" << t%10;
    }
    else if(num_alf == 13){
        cout << "Число в шетнадцатиричной системе исчисления: D" << t%10;
    }
    else if(num_alf == 14){
        cout << "Число в шетнадцатиричной системе исчисления: E" << t%10;
    }
    else if(num_alf == 15){
        cout << "Число в шетнадцатиричной системе исчисления: F" << t%10;
    }
    else{
        cout << "Число в шетнадцатиричной системе исчисления: " << t;
    }
    
    return 0;
}